Model: "generator"
_____________________________________________________________________________________________________________________________
Layer (type)                                      Output Shape                   Param #     Connected to                    
=============================================================================================================================
input_1 (InputLayer)                              [(None, 224, 192, 8, 2)]       0                                           
_____________________________________________________________________________________________________________________________
conv3d (Conv3D)                                   (None, 224, 192, 8, 64)        3520        input_1[0][0]                   
_____________________________________________________________________________________________________________________________
batch_normalization (BatchNormalization)          (None, 224, 192, 8, 64)        256         conv3d[0][0]                    
_____________________________________________________________________________________________________________________________
conv3d_1 (Conv3D)                                 (None, 224, 192, 8, 64)        110656      batch_normalization[0][0]       
_____________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)        (None, 224, 192, 8, 64)        256         conv3d_1[0][0]                  
_____________________________________________________________________________________________________________________________
concatenate (Concatenate)                         (None, 224, 192, 8, 66)        0           input_1[0][0]                   
                                                                                             batch_normalization_1[0][0]     
_____________________________________________________________________________________________________________________________
max_pooling3d (MaxPooling3D)                      (None, 112, 96, 4, 66)         0           concatenate[0][0]               
_____________________________________________________________________________________________________________________________
conv3d_2 (Conv3D)                                 (None, 112, 96, 4, 128)        228224      max_pooling3d[0][0]             
_____________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)        (None, 112, 96, 4, 128)        512         conv3d_2[0][0]                  
_____________________________________________________________________________________________________________________________
conv3d_3 (Conv3D)                                 (None, 112, 96, 4, 128)        442496      batch_normalization_2[0][0]     
_____________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)        (None, 112, 96, 4, 128)        512         conv3d_3[0][0]                  
_____________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)                       (None, 112, 96, 4, 194)        0           max_pooling3d[0][0]             
                                                                                             batch_normalization_3[0][0]     
_____________________________________________________________________________________________________________________________
max_pooling3d_1 (MaxPooling3D)                    (None, 56, 48, 2, 194)         0           concatenate_1[0][0]             
_____________________________________________________________________________________________________________________________
conv3d_4 (Conv3D)                                 (None, 56, 48, 2, 256)         1341184     max_pooling3d_1[0][0]           
_____________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)        (None, 56, 48, 2, 256)         1024        conv3d_4[0][0]                  
_____________________________________________________________________________________________________________________________
conv3d_5 (Conv3D)                                 (None, 56, 48, 2, 256)         1769728     batch_normalization_4[0][0]     
_____________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalization)        (None, 56, 48, 2, 256)         1024        conv3d_5[0][0]                  
_____________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)                       (None, 56, 48, 2, 450)         0           max_pooling3d_1[0][0]           
                                                                                             batch_normalization_5[0][0]     
_____________________________________________________________________________________________________________________________
max_pooling3d_2 (MaxPooling3D)                    (None, 28, 24, 1, 450)         0           concatenate_2[0][0]             
_____________________________________________________________________________________________________________________________
conv3d_6 (Conv3D)                                 (None, 28, 24, 1, 512)         6221312     max_pooling3d_2[0][0]           
_____________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalization)        (None, 28, 24, 1, 512)         2048        conv3d_6[0][0]                  
_____________________________________________________________________________________________________________________________
dropout (Dropout)                                 (None, 28, 24, 1, 512)         0           batch_normalization_6[0][0]     
_____________________________________________________________________________________________________________________________
conv3d_7 (Conv3D)                                 (None, 28, 24, 1, 512)         7078400     dropout[0][0]                   
_____________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalization)        (None, 28, 24, 1, 512)         2048        conv3d_7[0][0]                  
_____________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)                       (None, 28, 24, 1, 962)         0           max_pooling3d_2[0][0]           
                                                                                             batch_normalization_7[0][0]     
_____________________________________________________________________________________________________________________________
up_sampling3d (UpSampling3D)                      (None, 56, 48, 2, 962)         0           concatenate_3[0][0]             
_____________________________________________________________________________________________________________________________
conv3d_8 (Conv3D)                                 (None, 56, 48, 2, 256)         1970432     up_sampling3d[0][0]             
_____________________________________________________________________________________________________________________________
concatenate_4 (Concatenate)                       (None, 56, 48, 2, 706)         0           concatenate_2[0][0]             
                                                                                             conv3d_8[0][0]                  
_____________________________________________________________________________________________________________________________
conv3d_9 (Conv3D)                                 (None, 56, 48, 2, 256)         4880128     concatenate_4[0][0]             
_____________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalization)        (None, 56, 48, 2, 256)         1024        conv3d_9[0][0]                  
_____________________________________________________________________________________________________________________________
conv3d_10 (Conv3D)                                (None, 56, 48, 2, 256)         1769728     batch_normalization_8[0][0]     
_____________________________________________________________________________________________________________________________
batch_normalization_9 (BatchNormalization)        (None, 56, 48, 2, 256)         1024        conv3d_10[0][0]                 
_____________________________________________________________________________________________________________________________
concatenate_5 (Concatenate)                       (None, 56, 48, 2, 962)         0           concatenate_4[0][0]             
                                                                                             batch_normalization_9[0][0]     
_____________________________________________________________________________________________________________________________
up_sampling3d_1 (UpSampling3D)                    (None, 112, 96, 4, 962)        0           concatenate_5[0][0]             
_____________________________________________________________________________________________________________________________
conv3d_11 (Conv3D)                                (None, 112, 96, 4, 128)        985216      up_sampling3d_1[0][0]           
_____________________________________________________________________________________________________________________________
concatenate_6 (Concatenate)                       (None, 112, 96, 4, 322)        0           concatenate_1[0][0]             
                                                                                             conv3d_11[0][0]                 
_____________________________________________________________________________________________________________________________
conv3d_12 (Conv3D)                                (None, 112, 96, 4, 128)        1112960     concatenate_6[0][0]             
_____________________________________________________________________________________________________________________________
batch_normalization_10 (BatchNormalization)       (None, 112, 96, 4, 128)        512         conv3d_12[0][0]                 
_____________________________________________________________________________________________________________________________
conv3d_13 (Conv3D)                                (None, 112, 96, 4, 128)        442496      batch_normalization_10[0][0]    
_____________________________________________________________________________________________________________________________
batch_normalization_11 (BatchNormalization)       (None, 112, 96, 4, 128)        512         conv3d_13[0][0]                 
_____________________________________________________________________________________________________________________________
concatenate_7 (Concatenate)                       (None, 112, 96, 4, 450)        0           concatenate_6[0][0]             
                                                                                             batch_normalization_11[0][0]    
_____________________________________________________________________________________________________________________________
up_sampling3d_2 (UpSampling3D)                    (None, 224, 192, 8, 450)       0           concatenate_7[0][0]             
_____________________________________________________________________________________________________________________________
conv3d_14 (Conv3D)                                (None, 224, 192, 8, 64)        230464      up_sampling3d_2[0][0]           
_____________________________________________________________________________________________________________________________
concatenate_8 (Concatenate)                       (None, 224, 192, 8, 130)       0           concatenate[0][0]               
                                                                                             conv3d_14[0][0]                 
_____________________________________________________________________________________________________________________________
conv3d_15 (Conv3D)                                (None, 224, 192, 8, 64)        224704      concatenate_8[0][0]             
_____________________________________________________________________________________________________________________________
batch_normalization_12 (BatchNormalization)       (None, 224, 192, 8, 64)        256         conv3d_15[0][0]                 
_____________________________________________________________________________________________________________________________
conv3d_16 (Conv3D)                                (None, 224, 192, 8, 64)        110656      batch_normalization_12[0][0]    
_____________________________________________________________________________________________________________________________
batch_normalization_13 (BatchNormalization)       (None, 224, 192, 8, 64)        256         conv3d_16[0][0]                 
_____________________________________________________________________________________________________________________________
concatenate_9 (Concatenate)                       (None, 224, 192, 8, 194)       0           concatenate_8[0][0]             
                                                                                             batch_normalization_13[0][0]    
_____________________________________________________________________________________________________________________________
conv3d_17 (Conv3D)                                (None, 224, 192, 8, 2)         390         concatenate_9[0][0]             
=============================================================================================================================
Total params: 28,933,958
Trainable params: 28,928,326
Non-trainable params: 5,632
_____________________________________________________________________________________________________________________________
Model: "discriminator"
_____________________________________________________________________________________________________________________________
Layer (type)                                      Output Shape                   Param #     
=============================================================================================================================
disc_conv_1 (Conv3D)                              (None, 112, 96, 4, 64)         8256        
_____________________________________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)                           (None, 112, 96, 4, 64)         0           
_____________________________________________________________________________________________________________________________
disc_conv_2 (Conv3D)                              (None, 56, 48, 2, 64)          262208      
_____________________________________________________________________________________________________________________________
disc_conv_2_bn (BatchNormalization)               (None, 56, 48, 2, 64)          256         
_____________________________________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)                         (None, 56, 48, 2, 64)          0           
_____________________________________________________________________________________________________________________________
disc_conv_3 (Conv3D)                              (None, 28, 24, 1, 128)         524416      
_____________________________________________________________________________________________________________________________
disc_conv_3_bn (BatchNormalization)               (None, 28, 24, 1, 128)         512         
_____________________________________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)                         (None, 28, 24, 1, 128)         0           
_____________________________________________________________________________________________________________________________
disc_conv_4 (Conv3D)                              (None, 14, 12, 1, 256)         2097408     
_____________________________________________________________________________________________________________________________
disc_conv_4_bn (BatchNormalization)               (None, 14, 12, 1, 256)         1024        
_____________________________________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)                         (None, 14, 12, 1, 256)         0           
_____________________________________________________________________________________________________________________________
disc_conv_5 (Conv3D)                              (None, 7, 6, 1, 256)           4194560     
_____________________________________________________________________________________________________________________________
disc_conv_5_bn (BatchNormalization)               (None, 7, 6, 1, 256)           1024        
_____________________________________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)                         (None, 7, 6, 1, 256)           0           
_____________________________________________________________________________________________________________________________
disc_conv_6 (Conv3D)                              (None, 4, 3, 1, 256)           4194560     
_____________________________________________________________________________________________________________________________
disc_conv_6_bn (BatchNormalization)               (None, 4, 3, 1, 256)           1024        
_____________________________________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)                         (None, 4, 3, 1, 256)           0           
_____________________________________________________________________________________________________________________________
disc_conv_7 (Conv3D)                              (None, 2, 2, 1, 256)           4194560     
_____________________________________________________________________________________________________________________________
disc_conv_7_bn (BatchNormalization)               (None, 2, 2, 1, 256)           1024        
_____________________________________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)                         (None, 2, 2, 1, 256)           0           
_____________________________________________________________________________________________________________________________
flatten (Flatten)                                 (None, 1024)                   0           
_____________________________________________________________________________________________________________________________
disc_dense (Dense)                                (None, 2)                      2050        
=============================================================================================================================
Total params: 15,482,882
Trainable params: 15,480,450
Non-trainable params: 2,432
_____________________________________________________________________________________________________________________________
Model: "CGAN"
_____________________________________________________________________________________________________________________________
Layer (type)                                      Output Shape                   Param #     
=============================================================================================================================
CGAN_input (InputLayer)                           [(None, 224, 192, 8, 2)]       0           
_____________________________________________________________________________________________________________________________
generator (Functional)                            (None, 224, 192, 8, 2)         28933958    
_____________________________________________________________________________________________________________________________
discriminator (Sequential)                        (None, 2)                      15482882    
=============================================================================================================================
Total params: 44,416,840
Trainable params: 28,928,326
Non-trainable params: 15,488,514
_____________________________________________________________________________________________________________________________
